tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/dupes'
brew 'android-sdk'
brew 'android-ndk'
brew 'autoconf'
brew 'automake'
brew 'coreutils'
brew 'lame'
brew 'x264'
brew 'xvid'
brew 'ffmpeg'
brew 'gdbm'
brew 'gettext'
brew 'gmp'
brew 'gnu-getopt'
brew 'isl'
brew 'keychain'
brew 'mpfr'
brew 'libmpc'
brew 'libtool'
brew 'libvo-aacenc'
brew 'mas'
brew 'media-info'
brew 'nettle'
brew 'openssl'
brew 'pcre'
brew 'pkg-config'
brew 'readline'
brew 'sqlite'
brew 'xz'
brew 'python3'
brew 'rdfind'
brew 'rename'
brew 'trash'
brew 'watch'
brew 'wget'
brew 'homebrew/dupes/grep', args: ['with-default-names']
brew 'homebrew/dupes/make'
brew 'homebrew/dupes/rsync'
cask 'timestamp'
mas 'Black and White 2', id: 437519881
mas 'Blackmagic Disk Speed Test', id: 425264550
mas 'Camera Record Pro', id: 1056029469
mas 'Clipboard History', id: 420939835
mas 'Divvy', id: 413857545
mas 'Easy Video Trim', id: 625963401
mas 'gps4cam', id: 704400176
mas 'iMovie', id: 408981434
mas 'Keynote', id: 409183694
mas 'LINE', id: 539883307
mas 'LittleIpsum', id: 405772121
mas 'MediaInfo', id: 510620098
mas 'Microsoft Remote Desktop', id: 715768417
mas 'Movie Rotate FREE', id: 986566891
mas 'Music Speed Changer', id: 813546051
mas 'NetSpot', id: 514951692
mas 'NetSpot Wi-Fi Reporter', id: 678464954
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'PeakHour 3', id: 961578824
mas 'PureBlocks Lite', id: 965018151
mas 'Quick Recorder', id: 1020149961
mas 'RSS Bot', id: 605732865
mas 'Slack', id: 803453959
mas 'Smart Converter Pro', id: 450078312
mas 'Stock + Pro', id: 534067900
mas 'Tag Editor Free', id: 984278082
mas 'Textual', id: 896450579
mas 'The Unarchiver', id: 425424353
mas 'Transmit', id: 403388562
mas 'Trillian', id: 412056820
mas 'Twitter', id: 409789998
mas 'Video Edit - Cut Rotate Crop Mosaic Lite', id: 975786365
mas 'Xcode', id: 497799835
