# IDEs
mas 'Xcode', id: 497799835
cask 'coda'

# console and ssh
cask 'iterm2'
brew 'openssl'
brew 'keychain'

# text editors
cask 'sublime-text'
cask 'macdown'
cask 'hex-fiend'
# cask 'mou'
# Error: Cask mou depends on macOS release <= 10.11, but you are running release 10.12.
# Error: nothing to install
# ==> Satisfying dependencies
# Installing mou has failed!
brew 'vim', args: ['with-override-system-vi']

# file transfer
#cask 'transmit'
mas 'Transmit', id: 403388562

# programming
brew 'python3'
brew 'gnu-getopt'
brew 'lua'

# libraries
brew 'pcre' #Perl compatible regular expressions library
brew 'gettext' #GNU internationalization (i18n) and localization (l10n) library
brew 'libtool' #Generic library support script
#brew 'xz' #General-purpose data compression with high compression ratio

# utilities
brew 'ack'
brew 'rdfind'
brew 'lynx'
brew 'rename'
brew 'trash'
brew 'watch'
brew 'tree'
brew 'p7zip'
brew 'wget'
brew 'readline'
brew 'gnu-sed', args: ['with-default-names']
brew 'grep', args: ['with-default-names']
brew 'make'
brew 'rsync'
#brew 'openssh' # need to resolve agent strategy Bad configuration option: usekeychain
brew 'screen'

# Install GNU core utilities (those that come with macOS are outdated).
# Don’t forget to add `$(brew --prefix coreutils)/libexec/gnubin` to `$PATH`.
brew 'coreutils'

# Install some other useful utilities like `sponge`.
brew 'moreutils'
# Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed.
brew 'findutils'

# compiling
brew 'autoconf' #Automatic configure script builder
brew 'automake' #Tool for generating GNU Standards-compliant Makefiles
brew 'pkg-config' #Manage compile and link flags for libraries
